Tekla.Structures.Drawing.FrameTypes
The available frame styles around the object.

Tekla.Structures.Drawing.FrameTypes.None
No frame.

Tekla.Structures.Drawing.FrameTypes.Rectangular
The rectangular frame.

Tekla.Structures.Drawing.FrameTypes.Line
A line under the object.

Tekla.Structures.Drawing.FrameTypes.Round
The frame with rounded ends.

Tekla.Structures.Drawing.FrameTypes.Circle
The circular frame.

Tekla.Structures.Drawing.FrameTypes.Diamond
The frame looking like a diamond.

Tekla.Structures.Drawing.FrameTypes.Hexagon
The hexagonally shaped frame.

Tekla.Structures.Drawing.FrameTypes.Triangle
The triangular frame.

Tekla.Structures.Drawing.FrameTypes.Sharpened
The frame with sharpened ends.